hibernate/手记.html
<?xml version="1.0" encoding="gbk"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>手记</title>
<meta http-equiv="Content-Type" content="text/html;charset=gbk"/>
<meta name="title" content="手记"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-14 22:43:46 中国标准时间"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">手记</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 项目的搭建</a>
<ul>
<li><a href="#sec-1-1">1.1 项目基本框架</a></li>
<li><a href="#sec-1-2">1.2 添加jar包</a></li>
<li><a href="#sec-1-3">1.3 配置数据库</a></li>
<li><a href="#sec-1-4">1.4 配置文件</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 项目的搭建</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 项目基本框架</h3>
<div class="outline-text-3" id="text-1-1">

<ul>
<li>使用工具自动生成
<ul>
<li>eclipse
</li>
<li>maven
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 添加jar包</h3>
<div class="outline-text-3" id="text-1-2">

</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 配置数据库</h3>
<div class="outline-text-3" id="text-1-3">

<p>  在jar包中找到配置模板,添加到meta-inf文件夹中
</p></div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 配置文件</h3>
<div class="outline-text-3" id="text-1-4">

<ul>
<li>struts2配置 - web.xml
</li>
<li>spring配置  - web.xlm
</li>
<li>hibernate配置 hibernate.cfg.xml
</li>
</ul>

<p> web.xml配置信息
</p>


<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#28155;&#21152;spring&#25903;&#25345; </span><span style="color: #b22222;">--&gt;</span>
 <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> spring&#20013;bean&#30340;&#37197;&#32622;&#25991;&#20214;&#20301;&#32622; </span><span style="color: #b22222;">--&gt;</span>
 &lt;<span style="color: #87cefa;">context-param</span>&gt;
       &lt;<span style="color: #87cefa;">param-name</span>&gt;contextConfigLocation&lt;/<span style="color: #87cefa;">param-name</span>&gt;
       &lt;<span style="color: #87cefa;">param-value</span>&gt;classpath:beans.xml&lt;/<span style="color: #87cefa;">param-value</span>&gt;
 &lt;/<span style="color: #87cefa;">context-param</span>&gt;
 &lt;<span style="color: #87cefa;">listener</span>&gt;
       &lt;<span style="color: #87cefa;">listener-class</span>&gt;org.springframework.web.context.ContextLoaderListener&lt;/<span style="color: #87cefa;">listener-class</span>&gt;
 &lt;/<span style="color: #87cefa;">listener</span>&gt;

 <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> jpa &#20013;&#24310;&#36831;&#21152;&#36733;&#37197;&#32622; </span><span style="color: #b22222;">--&gt;</span>
 &lt;<span style="color: #87cefa;">filter</span>&gt;
       &lt;<span style="color: #87cefa;">filter-name</span>&gt;Spring OpenEntityManagerInViewFilter&lt;/<span style="color: #87cefa;">filter-name</span>&gt;
       &lt;<span style="color: #87cefa;">filter-class</span>&gt;org.springframework.orm.jpa.support.OpenEntityManagerInViewFilter&lt;/<span style="color: #87cefa;">filter-class</span>&gt;
       <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#21021;&#22987;&#21270;&#21442;&#25968; entityManger&#24037;&#21378;&#30340;&#21517;&#31216;&#20026;entityManagerFactory </span><span style="color: #b22222;">--&gt;</span>
       &lt;<span style="color: #87cefa;">init-param</span>&gt;
               &lt;<span style="color: #87cefa;">param-name</span>&gt;entityManagerFactoryBeanName&lt;/<span style="color: #87cefa;">param-name</span>&gt;
               &lt;<span style="color: #87cefa;">param-value</span>&gt;entityManagerFactory&lt;/<span style="color: #87cefa;">param-value</span>&gt;
       &lt;/<span style="color: #87cefa;">init-param</span>&gt;
 &lt;/<span style="color: #87cefa;">filter</span>&gt;
 &lt;<span style="color: #87cefa;">filter-mapping</span>&gt;
       &lt;<span style="color: #87cefa;">filter-name</span>&gt;Spring OpenEntityManagerInViewFilter&lt;/<span style="color: #87cefa;">filter-name</span>&gt;
       &lt;<span style="color: #87cefa;">url-pattern</span>&gt;/*&lt;/<span style="color: #87cefa;">url-pattern</span>&gt;
 &lt;/<span style="color: #87cefa;">filter-mapping</span>&gt;

 <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#28155;&#21152;struts2&#25903;&#25345; </span><span style="color: #b22222;">--&gt;</span>
 &lt;<span style="color: #87cefa;">filter</span>&gt;
       &lt;<span style="color: #87cefa;">filter-name</span>&gt;struts2&lt;/<span style="color: #87cefa;">filter-name</span>&gt;
       &lt;<span style="color: #87cefa;">filter-class</span>&gt;org.apache.struts2.dispatcher.ng.filter.StrutsPrepareAndExecuteFilter&lt;/<span style="color: #87cefa;">filter-class</span>&gt;
 &lt;/<span style="color: #87cefa;">filter</span>&gt;
 &lt;<span style="color: #87cefa;">filter-mapping</span>&gt;
       &lt;<span style="color: #87cefa;">filter-name</span>&gt;struts2&lt;/<span style="color: #87cefa;">filter-name</span>&gt;
       &lt;<span style="color: #87cefa;">url-pattern</span>&gt;/*&lt;/<span style="color: #87cefa;">url-pattern</span>&gt;
 &lt;/<span style="color: #87cefa;">filter-mapping</span>&gt;
</pre>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-08-14 22:43:46 中国标准时间</p>
<p class="author">Author: </p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
